/*
*排列  用1234.。9组成三个三位数 每个数字恰好用一次 要求a : b : c  = 1:2:3
*每行一个解
*
*
*
**/
//9个数之和45 之积362880 保持不变 
#include <stdio.h>
#include <math.h>
int  main(){
    int a = 100,b,c;
    for(;a<333;a++){
        b = 2 * a;
        c = 3 * a;
        if((a/100+a/10%10+a%10+b/100+b/10%10+b%10+c/100+c/10%10+c%10
           == 45)&& ((a/100) * (a/10%10) * (a%10) * (b/100) * (b/10%10) * (b%10) * (c/100) * (c/10%10) *
                     (c%10) == 362880)){
            printf("%d %d %d \n",a,b,c);
        }
    }

    return 0;
}
